Tekla.Structures.Drawing.DimensionSetBaseAttributes.ShortDimensionTypes
The position of the short dimension value.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.ShortDimensionTypes.Inside
The dimension value is set between the dimension lines when the dimension is too short.

Tekla.Structures.Drawing.DimensionSetBaseAttributes.ShortDimensionTypes.Outside
The dimension value is moved outside of the dimension when the dimension is too short.